Tutorial4/CylindricalSingle/system/snappyHexMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9  
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      snappyHexMeshDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

castellatedMesh true;
snap            true;
addLayers       false;

geometry
{
      vessel
    {
        type triSurfaceMesh;
        file "vessel.stl";
    }
 drafttube
    {
        type triSurfaceMesh;
        file "drafttube.stl";
    }
 inlet
    {
        type triSurfaceMesh;
        file "inlet.stl";
    }
 outlet
    {
        type searchableCylinder;
        point1 (619.62 1395.01 1116.13);
        point2 (619.62 1400.01 1116.13);
        radius 100;
    }




    //- Used to define MRF zone and refine mesh round the impeller 
   
}


castellatedMeshControls
{

    maxLocalCells 1000000;

    maxGlobalCells 20000000;

    minRefinementCells 0;

    nCellsBetweenLevels 2;

    maxLoadUnbalance 0.10;

    features
    (
        {
            file "vessel.eMesh";
            level 0;
        }

	{
            file "drafttube.eMesh";
            level 0;
        }
        {
            file "inlet.eMesh";
            level 5;
        }

	



      
    );

    resolveFeatureAngle 30;

    refinementSurfaces
    {
       

        vessel
        {
            level (0 0);
	        }
 	drafttube
        {
            level (0 0);
	        }
	inlet
        {
            level (5 5);
	        }
	outlet
	{
            level (0 1);
	        }


    }

    refinementRegions
    {
     /*  
        inlet
	{
	level (2 2);
	}*/
	outlet
	 {
            mode inside;
            levels ((1E15 1));
        }

    }

    locationInMesh (620.01 500.01 1150.01); // Inside point

    allowFreeStandingZoneFaces true;
}

// Settings for the snapping.
snapControls
{

    nSmoothPatch 3;

    tolerance 1.0;

    nSolveIter 300;

    nRelaxIter 10;

    nFeatureSnapIter 10;

    implicitFeatureSnap true;

    explicitFeatureSnap false;

    multiRegionFeatureSnap true;
}

// Settings for the layer addition.
addLayersControls
{

    relativeSizes true;

    layers
    {
    }

    expansionRatio 1.0;

    finalLayerThickness 0.3;

    minThickness 0.25;

    nGrow 0;

    featureAngle 30;

    nRelaxIter 5;

    nSmoothSurfaceNormals 1;

    nSmoothNormals 3;

    nSmoothThickness 10;

    maxFaceThicknessRatio 0.5;

    maxThicknessToMedialRatio 0.3;

    minMedianAxisAngle 90;

    nBufferCellsNoExtrude 0;

    nLayerIter 50;

    nRelaxedIter 20;
}

meshQualityControls
{
    #include "meshQualityDict"

    relaxed
    {
        maxNonOrtho 75;
    }
}

writeFlags
(
);

mergeTolerance 1E-6;


// ************************************************************************* //
