Tutorial4/CylindricalSingle/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

4
(
    walls//vessel
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          31017;
        startFace       929308;
    }
    outlet
    {
        type            patch;
        nFaces          4604;
        startFace       960325;
    }
    drafttube
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          14736;
        startFace       964929;
    }
    inlet
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          10148;
        startFace       979665;
    }
)

// ************************************************************************* //
