Tutorial4/CylindricalSingle/system/setFieldsDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      setFieldsDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

defaultFieldValues
(
    volScalarFieldValue alpha.air 1
    volScalarFieldValue alpha.water 0
);

regions
(
    boxToCell
    {
        box (-5 -1 -5) (5 1.21 5);//y 
       fieldValues
        (
            volScalarFieldValue alpha.air 0
	   volScalarFieldValue alpha.water 1

        );
    }
);


// ************************************************************************* //
